{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3f7b19bf",
   "metadata": {},
   "source": [
    "# Practice: Query Neo4J-POLE\n",
    "\n",
    "Neo4j is a graph database. Data can be stored in Neo4j in the form of a graph, very very large graph.\n",
    "\n",
    "To query the Neo4j database, we use Cypher. Cypher is designed to look like SQL. It is ease to learn Cypher. The key is to understand the reason for the existence of graph databases and the kind of queries made on graph databases.\n",
    "\n",
    "We will work on the Example Project that comes with Neo4j Desktop version. The data in this database has the following structure:\n",
    "\n",
    "POLE-50 Crime Investigation Knowledge Graph\n",
    "\n",
    "The POLE-50 dataset represents a real-world crime investigation knowledge graph built on the POLE model — Person, Object, Location, and Event.\n",
    "It is designed to capture relationships and patterns between people, places, things, and incidents that occur in a crime domain.\n",
    "\n",
    "This dataset is stored in Neo4j, a native graph database that stores data as nodes (entities) and relationships (connections).\n",
    "We query this graph using Cypher, Neo4j’s query language that is intuitive and similar to SQL but optimized for graph traversal and pattern discover\n",
    "\n",
    "The following figure summarizes this. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "cba43753-13e4-4b9a-9906-d3cc8f1e20ea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.13/site-packages (2.2.3)\n",
      "Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.1.3)\n",
      "Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2.9.0.post0)\n",
      "Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2024.1)\n",
      "Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas) (2025.2)\n",
      "Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)\n"
     ]
    }
   ],
   "source": [
    "!pip install pandas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "80aa4cbc-f9b2-43c2-afeb-d756dca7ee68",
   "metadata": {},
   "outputs": [],
   "source": [
    "import matplotlib.pyplot as plt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ccd68749-603c-4558-8618-f01e9222ea52",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "17d597be-1819-4926-adef-16f536120cb3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: py2neo in /opt/anaconda3/lib/python3.13/site-packages (2021.2.4)\n",
      "Requirement already satisfied: certifi in /opt/anaconda3/lib/python3.13/site-packages (from py2neo) (2025.8.3)\n",
      "Requirement already satisfied: interchange~=2021.0.4 in /opt/anaconda3/lib/python3.13/site-packages (from py2neo) (2021.0.4)\n",
      "Requirement already satisfied: monotonic in /opt/anaconda3/lib/python3.13/site-packages (from py2neo) (1.6)\n",
      "Requirement already satisfied: packaging in /opt/anaconda3/lib/python3.13/site-packages (from py2neo) (24.2)\n",
      "Requirement already satisfied: pansi>=2020.7.3 in /opt/anaconda3/lib/python3.13/site-packages (from py2neo) (2024.11.0)\n",
      "Requirement already satisfied: pygments>=2.0.0 in /opt/anaconda3/lib/python3.13/site-packages (from py2neo) (2.19.1)\n",
      "Requirement already satisfied: six>=1.15.0 in /opt/anaconda3/lib/python3.13/site-packages (from py2neo) (1.17.0)\n",
      "Requirement already satisfied: urllib3 in /opt/anaconda3/lib/python3.13/site-packages (from py2neo) (2.3.0)\n",
      "Requirement already satisfied: pytz in /opt/anaconda3/lib/python3.13/site-packages (from interchange~=2021.0.4->py2neo) (2024.1)\n",
      "Requirement already satisfied: pillow in /opt/anaconda3/lib/python3.13/site-packages (from pansi>=2020.7.3->py2neo) (11.1.0)\n"
     ]
    }
   ],
   "source": [
    "!pip install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "9d76e624-cfc9-412b-b089-0b4a39970dc1",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "5746ad75-20a6-4e92-8aa4-52582b5a0ebd",
   "metadata": {},
   "outputs": [],
   "source": [
    "import py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d8dcd1cf",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_db = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\",\"Aayansh@12345\"), name=\"pole-50\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "642711b0",
   "metadata": {},
   "source": [
    "We are now set. The modules are loaded. The database connection is established. We can query the database now. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b553afd",
   "metadata": {},
   "source": [
    "Let's start with finding the number of nodes and edges in the graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "b0c0964c-0ab6-4202-84c1-b5041a3c4b45",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>numNodes</th></tr><tr><td style=\"text-align:right\">61521</td></tr></table>"
      ],
      "text/plain": [
       " numNodes \n",
       "----------\n",
       "    61521 "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "numNodes = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN count(n) as numNodes\n",
    "\"\"\"\n",
    "graph_db.run(numNodes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "48a310ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>numRels</th></tr><tr><td style=\"text-align:right\">211680</td></tr></table>"
      ],
      "text/plain": [
       " numRels \n",
       "---------\n",
       "  211680 "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "numRels = \"\"\"\n",
    "MATCH ()-[r] -()\n",
    "RETURN count(r) as numRels\n",
    "\"\"\"\n",
    "graph_db.run(numRels)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cf1af897",
   "metadata": {},
   "source": [
    "There are 500 relationships.\n",
    "\n",
    "Let's now increase granularity of our queries. There are two labels in the graph. Let's query how many nodes belong to each of these labels."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "782d09a6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>numPersons</th></tr><tr><td style=\"text-align:right\">369</td></tr></table>"
      ],
      "text/plain": [
       " numPersons \n",
       "------------\n",
       "        369 "
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "numPersons = \"\"\"\n",
    "MATCH (p:Person)\n",
    "RETURN count(p) as numPersons\n",
    "\"\"\"\n",
    "graph_db.run(numPersons)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c1797887",
   "metadata": {},
   "source": [
    "So there are 131 Person nodes and 38 Movie nodes in the 169 total nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "ff4e0381",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>numCrimes</th></tr><tr><td style=\"text-align:right\">28762</td></tr></table>"
      ],
      "text/plain": [
       " numCrimes \n",
       "-----------\n",
       "     28762 "
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "numCrimes = \"\"\"\n",
    "MATCH (c:Crime)\n",
    "RETURN count(c) AS numCrimes\n",
    "\"\"\"\n",
    "graph_db.run(numCrimes)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9edcd02a",
   "metadata": {},
   "source": [
    "We can do a similar exercise for relations as well."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "f2990f1e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>numLocations</th></tr><tr><td style=\"text-align:right\">14904</td></tr></table>"
      ],
      "text/plain": [
       " numLocations \n",
       "--------------\n",
       "        14904 "
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "numLocations = \"\"\"\n",
    "MATCH (l:Location)\n",
    "RETURN count(l) AS numLocations\n",
    "\"\"\"\n",
    "graph_db.run(numLocations)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "7a97ab03",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>numRelationships</th></tr><tr><td style=\"text-align:right\">105840</td></tr></table>"
      ],
      "text/plain": [
       " numRelationships \n",
       "------------------\n",
       "           105840 "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "numRelationships = \"\"\"\n",
    "MATCH ()-[r]->()\n",
    "RETURN count(r) AS numRelationships\n",
    "\"\"\"\n",
    "graph_db.run(numRelationships)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "ea1987f0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>crimeType</th><th>total</th></tr><tr><td style=\"text-align:left\">Violence and sexual offences</td><td style=\"text-align:right\">8765</td></tr><tr><td style=\"text-align:left\">Public order</td><td style=\"text-align:right\">4839</td></tr><tr><td style=\"text-align:left\">Criminal damage and arson</td><td style=\"text-align:right\">3587</td></tr></table>"
      ],
      "text/plain": [
       " crimeType                    | total \n",
       "------------------------------|-------\n",
       " Violence and sexual offences |  8765 \n",
       " Public order                 |  4839 \n",
       " Criminal damage and arson    |  3587 "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "topCrimes = \"\"\"\n",
    "MATCH (c)\n",
    "WHERE c.category IS NOT NULL OR c.type IS NOT NULL\n",
    "RETURN coalesce(c.category, c.type) AS crimeType, count(*) AS total\n",
    "ORDER BY total DESC\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "graph_db.run(topCrimes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "a0a59c5e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>people</th></tr><tr><td style=\"text-align:left\">(_0:Person {name: &#039;Todd&#039;, nhs_no: &#039;117-66-8129&#039;, surname: &#039;Hamilton&#039;})</td></tr><tr><td style=\"text-align:left\">(_2:Person {name: &#039;Benjamin&#039;, nhs_no: &#039;991-70-5333&#039;, surname: &#039;Hamilton&#039;})</td></tr><tr><td style=\"text-align:left\">(_5:Person {name: &#039;Nancy&#039;, nhs_no: &#039;620-83-1546&#039;, surname: &#039;Campbell&#039;})</td></tr></table>"
      ],
      "text/plain": [
       " people                                                                     \n",
       "----------------------------------------------------------------------------\n",
       " (_0:Person {name: 'Todd', nhs_no: '117-66-8129', surname: 'Hamilton'})     \n",
       " (_2:Person {name: 'Benjamin', nhs_no: '991-70-5333', surname: 'Hamilton'}) \n",
       " (_5:Person {name: 'Nancy', nhs_no: '620-83-1546', surname: 'Campbell'})    "
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fivePeople = \"\"\"\n",
    "MATCH (people:Person)\n",
    "RETURN people\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "graph_db.run(fivePeople)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "85edccad",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>people</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'nhs_no': '117-66-8129', 'surname': 'Hamilton...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'nhs_no': '991-70-5333', 'surname': 'Hamilton...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'nhs_no': '620-83-1546', 'surname': 'Campbell...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'nhs_no': '595-90-8809', 'surname': 'Garcia',...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'nhs_no': '556-65-1110', 'surname': 'Turner',...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              people\n",
       "0  {'nhs_no': '117-66-8129', 'surname': 'Hamilton...\n",
       "1  {'nhs_no': '991-70-5333', 'surname': 'Hamilton...\n",
       "2  {'nhs_no': '620-83-1546', 'surname': 'Campbell...\n",
       "3  {'nhs_no': '595-90-8809', 'surname': 'Garcia',...\n",
       "4  {'nhs_no': '556-65-1110', 'surname': 'Turner',..."
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fivePeopleCursor = graph_db.run(fivePeople)\n",
    "dfFivePeople = fivePeopleCursor.to_data_frame()\n",
    "dfFivePeople"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "292e79ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "py2neo.cypher.Cursor"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(fivePeopleCursor)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "bfece9d3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table></table>"
      ],
      "text/plain": []
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fivePeopleCursor.to_table()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "da69b626",
   "metadata": {},
   "source": [
    "This is a more elegant solution compared to what I showed your seniors. Given the paucity of time, I did not explore enough and I jumped into my comfort zone - Pandas."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "fec87e76",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "548c5607",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'nhs_no': '117-66-8129', 'surname': 'Hamilton...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'nhs_no': '991-70-5333', 'surname': 'Hamilton...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'nhs_no': '620-83-1546', 'surname': 'Campbell...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'nhs_no': '595-90-8809', 'surname': 'Garcia',...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'nhs_no': '556-65-1110', 'surname': 'Turner',...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   0\n",
       "0  {'nhs_no': '117-66-8129', 'surname': 'Hamilton...\n",
       "1  {'nhs_no': '991-70-5333', 'surname': 'Hamilton...\n",
       "2  {'nhs_no': '620-83-1546', 'surname': 'Campbell...\n",
       "3  {'nhs_no': '595-90-8809', 'surname': 'Garcia',...\n",
       "4  {'nhs_no': '556-65-1110', 'surname': 'Turner',..."
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(graph_db.run(fivePeople))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "46edbfeb",
   "metadata": {},
   "source": [
    "Ouch!!! No Forrest Gump there. Obviously an incomplete dataset. Hollywood would have made 38 movies in one year. The list of movies here are clearly not exhaustive. Anyway we are just practising. Let's keep practising.\n",
    "\n",
    "Notice that we used a function `type()` in the query. There are a lot of functions you can use to add details to your queries."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85afc175",
   "metadata": {},
   "source": [
    "Notice that Hanks directed a movie. Let's see if he was associated with movies in non-acting roles. "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bed165dc",
   "metadata": {},
   "source": [
    "Talking about directors let's get back to Keanu Reeves and see who directed The Matrix."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "02206170",
   "metadata": {},
   "source": [
    "So far we have done basic queries. We had specific questions to ask. The queries involved specific questions about nodes and their relationships. \n",
    "\n",
    "Now lets introduce the idea of __paths__. You can query a travesal beyond a single hop."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "68572297",
   "metadata": {},
   "source": [
    "You can examine this and see that all the details of the people and the movies are captured. There are 59 colleages in total which whom these relationships exist."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
